Catalogs/СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СкидкиНаценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:EnumRef.СпособыПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКартыЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментПодарков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКратность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеДляСкидкиКоличеством</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьОкругления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПсихологическоеОкругление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПримененияСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтсрочкиНачалаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовОтсрочкиНачалаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаРезультатаСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаРезультатаСовместногоПрименения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтбораНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатурыОграничения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленДополнительныйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьУмножениеВРамкахВышестоящейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбновленНаПроизводительныйРежим</Name>
					<Comment>Служебный реквизит для обновления информационной базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияПредоставления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПредоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиНаценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДляКаждойСтроки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартаЛояльности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкруглениеСуммы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПримененияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыПримененияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрименитьВМоментРасчетаСкидокНаценок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислитьБонусныеБаллы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СегментНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборКомпоновкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСегментНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыСовместногоПримененияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыСовместногоПримененияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Умножение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вытеснение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СкидкиНаценки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЭтоГруппа Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Наименование");
		
		Если Ссылка = Справочники.СкидкиНаценки.КорневаяГруппа Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Родитель");
		КонецЕсли;
		
	Иначе
		
		Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
		КонецЕсли;
		
		Если (СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Сумма
			И СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы
			И СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.СуммаДляКаждойСтроки)
			И СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
		КонецЕсли;
		
		Если СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.СуммаДляКаждойСтроки Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			
		ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
			
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			КонецЕсли;
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			
			Если ЗначениеЗаполнено(ТочностьОкругления) И
				ПсихологическоеОкругление >= ТочностьОкругления Тогда
				
				ТекстОшибки = НСтр("ru='Психологическое округление должно быть меньше точности округления'");
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ПсихологическоеОкругление",
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТочностьОкругления");
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Количество Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
		КонецЕсли;
		
		Если СпособПримененияСкидки <> Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПериодДействия");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодовДействия");
			МассивНепроверяемыхРеквизитов.Добавить("ПериодОтсрочкиНачалаДействия");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодовОтсрочкиНачалаДействия");
			МассивНепроверяемыхРеквизитов.Добавить("БонуснаяПрограммаЛояльности");
		КонецЕсли;
		
		Если ТипЗнч(СпособПредоставления) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
		КонецЕсли;
			
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Количество Тогда
			Если ЗначениеСкидкиНаценки >= УсловиеДляСкидкиКоличеством Тогда
			
				ТекстОшибки = НСтр("ru='Количество бесплатного товара должно быть меньше общего количества данного товара""'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ЗначениеСкидкиНаценки",
					,
					Отказ);
				
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("УсловиеДляСкидкиКоличеством");
		КонецЕсли;
		
		Если ВариантОтбораНоменклатуры <> Перечисления.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.СегментНоменклатуры
			Или ВариантОтбораНоменклатуры <> Перечисления.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.НеСегментНоменклатуры Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СегментНоменклатурыОграничения");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СкидкиНаценкиСервер.ПередЗаписью(ЭтотОбъект, Отказ);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Ссылка <> Справочники.СкидкиНаценки.КорневаяГруппа 
		И Не ЗначениеЗаполнено(Родитель) Тогда
		ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Поле ""Группа совместного применения"" обязательно к заполнению'"),,,, Отказ);
	КонецЕсли;
		
	ОчиститьНеиспользуемыеРеквизиты();
	УстановитьНастройкиУчетаПримененияСкидок();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		
		ВалютаПредоставления = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(ВалютаПредоставления);
		ВидЦены = Справочники.ВидыЦен.ВидЦеныПоУмолчанию(ВидЦены);
		
		Если ДанныеЗаполнения <> Неопределено
			И ДанныеЗаполнения.Свойство("СпособПредоставления")
			И ТипЗнч(ДанныеЗаполнения.СпособПредоставления) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			
			ВнешняяОбработка = СкидкиНаценкиПовтИсп.ОбъектВнешнейОбработки(ДанныеЗаполнения.СпособПредоставления);
			УстановитьБезопасныйРежим(Истина);
			СпособПримененияСкидки = ВнешняяОбработка.СпособПрименения();
			УстановитьБезопасныйРежим(Ложь);
			
		КонецЕсли;
		
		Если ДанныеЗаполнения <> Неопределено
			И ДанныеЗаполнения.Свойство("ДанныеДляЗаполненияРодителя")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДанныеДляЗаполненияРодителя) Тогда
			
			Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ДанныеДляЗаполненияРодителя, "Родитель");
			Если Не ЗначениеЗаполнено(Родитель) Тогда
				Родитель = Справочники.СкидкиНаценки.КорневаяГруппа;
			КонецЕсли;
			
		Иначе
			
			Родитель = Справочники.СкидкиНаценки.КорневаяГруппа;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ОчиститьНеиспользуемыеРеквизиты()

	Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
		
		ВалютаПредоставления = Неопределено;
		ЗначениеСкидкиНаценки = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
		
		Если СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок Тогда
			ВалютаПредоставления = Неопределено;
		КонецЕсли;
		
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
		
		ВидЦены = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
		
		ЗначениеСкидкиНаценки = Неопределено;
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности Тогда
		
		ЗначениеСкидкиНаценки = Неопределено;
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		ТекстСообщения = Неопределено;
		
	КонецЕсли;
	
	Если ЦеновыеГруппы.Количество() > 0 Тогда
		Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Процент И
			 СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.СуммаДляКаждойСтроки Тогда
			 ЦеновыеГруппы.Очистить();
		КонецЕсли; 
	КонецЕсли;	
	
	Если Не ЭтоГруппа И СпособПримененияСкидки <> Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
		БонуснаяПрограммаЛояльности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиУчетаПримененияСкидок()
	
	Если ЭтоГруппа Или ПрименятьУмножениеВРамкахВышестоящейГруппы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() И Родитель <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Родитель") Тогда
		
		ВариантСовместногоПримененияГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ВариантСовместногоПрименения");
		
		ПрименятьУмножениеВРамкахВышестоящейГруппы = 
				СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент 
				И ВариантСовместногоПримененияГруппы = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
